package by.it.sergeev.jd01_12;

import java.io.IOException;

public class Run {
    public static void main (String [] args) throws IOException {
        //A1.СоздатьсписокоценокучениковспомощьюArrayList,заполнитьслучайнымиоценками.Удалить неудовлетворительные оценки из списка. Вывести на консоль оба варианта.
        System.out.println("\n" + "---------------------------------------------------------------------------------------------------------");
        System.out.println("A1.");
        System.out.println("---------------------------------------------------------------------------------------------------------");
        TaskA.createArrayList();
        System.out.println("\n" + "---------------------------------------------------------------------------------------------------------");
        System.out.println("A2.");
        System.out.println("---------------------------------------------------------------------------------------------------------");
        TaskA.createArrayList2();
        System.out.println("\n" + "---------------------------------------------------------------------------------------------------------");
        System.out.println("A3.");
        System.out.println("---------------------------------------------------------------------------------------------------------");
        TaskA.createArrayList3();
        System.out.println("\n" + "---------------------------------------------------------------------------------------------------------");
    }
}
